app/controllers/experiences_controller.rb

SELECT "experiences".* FROM "experiences"
---
  def index
    @experiences = Experience.all

INSERT INTO "experiences" ("company", "description", "start_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @experience = Experience.new(experience_params)

    respond_to do |format|
      if @experience.save

UPDATE "experiences" SET "description" = ?, "start_date" = ?, "updated_at" = ? WHERE "experiences"."id" = ?  [["description", "Balanced exuding moderator"], ["start_date", "2015-07-23"], ["updated_at", "2015-09-07 16:56:58.841130"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @experience.update(experience_params)

DELETE FROM "experiences" WHERE "experiences"."id" = ?  [["id", 9]]
---
  def destroy
    @experience.destroy

SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = ? LIMIT 1  [["id", 9]]
---
    def set_experience
      @experience = Experience.find(params[:id])